<?php
require_once('config.php');

$A = 4;
$B = 5;
$size = 2048; 
$tpl_vars=array('condition'=> 'Дано сторони прямокутника a і b. 
Знайти його площу S = a · b і
периметр
P = 2 · (a + b). Вивести умову задачі, початкові значення та результуючі.' ,
 'A' => $A, 'B' => $B, 'S' => $A*$B, 'P' => 2 * ($A+$B), 
 'condition1' => 'Дан розмір файлу в байтах. Використовуючи операцію ділення
 націло, знайти кількість повних кілобайт, які займає даний файл (1 кілобайт =
 1024 байта). Вивести умову задачі, початкові значення та результуючі.', 
 'Size'=> $size ,'n1' => intdiv($size,1024));
$tpl_file='lab1-3.tmpl';
require_once('tpl_config.php');
?>