<?php
require_once('config.php');

$n1 = 5;
if ($n1>0)
    $res = $n1 + 1;
elseif ($n1 < 0)
    $res = $n1 - 2;
else
    $res = 10;

$n11 = 11;
$n12 = 15;
$n13 = 11;

$tpl_vars=array('cond' => 'Дано ціле число. Якщо воно є додатнім, то додати до нього 1; якщо
від`ємним, то відняти від нього 2; якщо нульовим, то замінити його на 10. Вивести умову задачі, 
початкові значення та результуючі.','n1' => $n1 , 'res' => $res, 'cond1' => 
'Дано три цілих числа, одне з яких відмінно від двох інших, рівних
між собою. Визначити порядковий номер числа, відмінного від осталь-
них. Вивести умову задачі, початкові значення та результуючі.', 'n11'=> 15 , 'n12' => 11,'n13' => 11);
$tpl_file='lab1-4.tmpl';
require_once('tpl_config.php');
?>